; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v13 ?v7)
             (pred_11 ?v8 ?v2)
             (pred_5 ?v13 ?v2)
             (pred_10 ?v11 ?v13 )
	     (pred_9 ?v13)
             (pred_8 ?v9)
             (pred_1 ?v8)
             (pred_7 ?v2)
             (pred_6 ?v13)
             (pred_4 ?v8)
             (pred_12 ?v13)
             (pred_2 ))



(:action op_1
:parameters (?v10 ?v4 ?v1 ?v12)
:precondition (and (pred_8 ?v10) (pred_8 ?v4) (pred_1 ?v1) (pred_7 ?v12)
          (pred_3 ?v10 ?v4) (pred_11 ?v1 ?v12)
                   (pred_5 ?v4 ?v12) (pred_9 ?v10) 
                   (pred_6 ?v4) (pred_4 ?v1))
:effect (and  (pred_12 ?v4) (not (pred_6 ?v4))))


(:action op_2
:parameters (?v10 ?v3)
:precondition (and (pred_8 ?v10) (pred_8 ?v3)
               (pred_9 ?v10) (pred_3 ?v10 ?v3) (pred_12 ?v3))
:effect (and (pred_9 ?v3) (not (pred_9 ?v10))))

(:action op_3
:parameters (?v10 ?v1)
:precondition (and (pred_8 ?v10) (pred_1 ?v1) 
                  (pred_9 ?v10) (pred_10 ?v1 ?v10) (pred_2 ))
:effect (and (pred_4 ?v1)
   (not (pred_10 ?v1 ?v10)) (not (pred_2 ))))


(:action op_4
:parameters (?v10 ?v6 ?v5)
:precondition (and (pred_8 ?v10) (pred_1 ?v6) (pred_1 ?v5)
                  (pred_9 ?v10) (pred_4 ?v5) (pred_10 ?v6 ?v10))
:effect (and (pred_4 ?v6) (pred_10 ?v5 ?v10)
        (not (pred_4 ?v5)) (not (pred_10 ?v6 ?v10))))

(:action op_5
:parameters (?v10 ?v1)
:precondition (and (pred_8 ?v10) (pred_1 ?v1) 
                  (pred_9 ?v10) (pred_4 ?v1))
:effect (and (pred_2 ) (pred_10 ?v1 ?v10) (not (pred_4 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_26 obj_04 obj_18 obj_30 obj_07 obj_21 obj_15 obj_02 obj_10 obj_03 obj_22 obj_23 obj_09 obj_08 obj_01 obj_11 obj_20 obj_29 obj_17 obj_06 obj_05 obj_25 obj_27 obj_14
    obj_13 obj_24
    obj_12 obj_16 obj_28
    )

    (:init
       (pred_2)

       (pred_8 obj_19)
       (pred_8 obj_26)
       (pred_8 obj_04)
       (pred_8 obj_18)
       (pred_8 obj_30)
       (pred_8 obj_07)
       (pred_8 obj_21)
       (pred_8 obj_15)
       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_22)
       (pred_8 obj_23)
       (pred_8 obj_09)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_11)
       (pred_8 obj_20)
       (pred_8 obj_29)
       (pred_8 obj_17)
       (pred_8 obj_06)
       (pred_8 obj_05)
       (pred_8 obj_25)
       (pred_8 obj_27)
       (pred_8 obj_14)
       (pred_7 obj_13)
       (pred_7 obj_24)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_28)

       (pred_3 obj_19 obj_07)
       (pred_3 obj_19 obj_26)
       (pred_3 obj_26 obj_21)
       (pred_3 obj_26 obj_04)
       (pred_3 obj_26 obj_19)
       (pred_3 obj_04 obj_15)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_04 obj_26)
       (pred_3 obj_18 obj_02)
       (pred_3 obj_18 obj_30)
       (pred_3 obj_18 obj_04)
       (pred_3 obj_30 obj_10)
       (pred_3 obj_30 obj_18)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_21)
       (pred_3 obj_07 obj_19)
       (pred_3 obj_21 obj_22)
       (pred_3 obj_21 obj_15)
       (pred_3 obj_21 obj_26)
       (pred_3 obj_21 obj_07)
       (pred_3 obj_15 obj_23)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_15 obj_04)
       (pred_3 obj_15 obj_21)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_02 obj_18)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_10 obj_08)
       (pred_3 obj_10 obj_30)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_03 obj_01)
       (pred_3 obj_03 obj_22)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_22 obj_03)
       (pred_3 obj_23 obj_20)
       (pred_3 obj_23 obj_09)
       (pred_3 obj_23 obj_15)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_09 obj_29)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_09 obj_23)
       (pred_3 obj_08 obj_17)
       (pred_3 obj_08 obj_10)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_01 obj_06)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_03)
       (pred_3 obj_11 obj_05)
       (pred_3 obj_11 obj_20)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_20 obj_25)
       (pred_3 obj_20 obj_29)
       (pred_3 obj_20 obj_23)
       (pred_3 obj_20 obj_11)
       (pred_3 obj_29 obj_27)
       (pred_3 obj_29 obj_17)
       (pred_3 obj_29 obj_09)
       (pred_3 obj_29 obj_20)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_17 obj_08)
       (pred_3 obj_17 obj_29)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_06 obj_01)
       (pred_3 obj_05 obj_25)
       (pred_3 obj_05 obj_11)
       (pred_3 obj_05 obj_06)
       (pred_3 obj_25 obj_27)
       (pred_3 obj_25 obj_20)
       (pred_3 obj_25 obj_05)
       (pred_3 obj_27 obj_14)
       (pred_3 obj_27 obj_29)
       (pred_3 obj_27 obj_25)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_14 obj_27)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_22)
       (pred_5  obj_07 obj_13)
       (pred_5  obj_06 obj_24)
       (pred_5  obj_22 obj_24)
       (pred_12 obj_19)
       (pred_12 obj_26)
       (pred_12 obj_04)
       (pred_12 obj_18)
       (pred_12 obj_30)
       (pred_12 obj_21)
       (pred_12 obj_15)
       (pred_12 obj_02)
       (pred_12 obj_10)
       (pred_12 obj_03)
       (pred_12 obj_23)
       (pred_12 obj_09)
       (pred_12 obj_08)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_20)
       (pred_12 obj_29)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_25)
       (pred_12 obj_27)
       (pred_12 obj_14)

       (pred_11  obj_12 obj_13)
       (pred_11  obj_16 obj_24)
       (pred_11  obj_28 obj_13)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_16 obj_05)
       (pred_10 obj_28 obj_02)
       (pred_9 obj_26)
    )

    (:goal (and
       (pred_10 obj_12 obj_15)
       (pred_10 obj_28 obj_19)
    ))
(:constraints
  (always (not (pred_9 obj_23)))
)
)

; plan
1. (op_2 obj_26 obj_21)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_21)
   goals met: 0 of 2
2. (op_2 obj_21 obj_15)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_15)
   goals met: 0 of 2
3. (op_2 obj_15 obj_02)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_02)
   goals met: 0 of 2
4. (op_3 obj_02 obj_28)
   deleted: (pred_10 obj_28 obj_02) (pred_2)
   added: (pred_4 obj_28)
   goals met: 0 of 2
5. (op_2 obj_02 obj_15)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_15)
   goals met: 0 of 2
6. (op_2 obj_15 obj_04)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_04)
   goals met: 0 of 2
7. (op_2 obj_04 obj_26)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_26)
   goals met: 0 of 2
8. (op_2 obj_26 obj_19)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_19)
   goals met: 0 of 2
9. (op_5 obj_19 obj_28)
   deleted: (pred_4 obj_28)
   added: (pred_2) (pred_10 obj_28 obj_19)
   goals met: 1 of 2
10. (op_2 obj_19 obj_26)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_26)
   goals met: 1 of 2
11. (op_2 obj_26 obj_04)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_04)
   goals met: 1 of 2
12. (op_2 obj_04 obj_15)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_15)
   goals met: 1 of 2
13. (op_2 obj_15 obj_02)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_02)
   goals met: 1 of 2
14. (op_2 obj_02 obj_09)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_09)
   goals met: 1 of 2
15. (op_2 obj_09 obj_29)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_29)
   goals met: 1 of 2
16. (op_2 obj_29 obj_20)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_20)
   goals met: 1 of 2
17. (op_3 obj_20 obj_12)
   deleted: (pred_10 obj_12 obj_20) (pred_2)
   added: (pred_4 obj_12)
   goals met: 1 of 2
18. (op_2 obj_20 obj_29)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_29)
   goals met: 1 of 2
19. (op_2 obj_29 obj_09)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_09)
   goals met: 1 of 2
20. (op_2 obj_09 obj_02)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_02)
   goals met: 1 of 2
21. (op_2 obj_02 obj_15)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_15)
   goals met: 1 of 2
22. (op_5 obj_15 obj_12)
   deleted: (pred_4 obj_12)
   added: (pred_2) (pred_10 obj_12 obj_15)
   goals met: 2 of 2
